; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v2 - type_2 ?v7 - type_3)
 	      (pred_3 ?v4 - object ?v7 - type_3)
	      (pred_1 ?v2 - type_2 ?v5 - type_1)
	      (pred_2 ?v2 - type_2 ?v4 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v2 - type_2 ?v8 ?v6 - type_3)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v6)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_2 ?v1 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v3) (pred_4 ?v2 ?v3) (pred_1 ?v2 ?v5))
       :effect (and (pred_2 ?v2 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_1 ?v2 ?v5))))

   (:action op_3
       :parameters (?v2 - type_2 ?v1 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v1 ?v5) (pred_4 ?v2 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_1 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_03 obj_08 - type_1
obj_07 obj_05 obj_01 - type_3
obj_06 obj_02 obj_09 - object)
(:init
(pred_4 obj_04 obj_07)
(pred_1 obj_04 obj_03)
(pred_1 obj_04 obj_08)
(pred_3 obj_06 obj_07)
(pred_3 obj_02 obj_01)
(pred_3 obj_09 obj_01)
)
(:goal
(and
(pred_3 obj_06 obj_01)
(pred_3 obj_02 obj_01)
(pred_3 obj_09 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_04 ?b obj_08))))
)
)

; plan
1. (op_2 obj_04 obj_06 obj_07 obj_03)
   deleted: (pred_3 obj_06 obj_07) (pred_1 obj_04 obj_03)
   added: (pred_2 obj_04 obj_06 obj_03)
   goals met: 1 of 3
2. (op_1 obj_04 obj_07 obj_01)
   deleted: (pred_4 obj_04 obj_07)
   added: (pred_4 obj_04 obj_01)
   goals met: 1 of 3
3. (op_3 obj_04 obj_06 obj_01 obj_03)
   deleted: (pred_2 obj_04 obj_06 obj_03)
   added: (pred_3 obj_06 obj_01) (pred_1 obj_04 obj_03)
   goals met: 2 of 3
4. (op_2 obj_04 obj_09 obj_01 obj_03)
   deleted: (pred_3 obj_09 obj_01) (pred_1 obj_04 obj_03)
   added: (pred_2 obj_04 obj_09 obj_03)
   goals met: 2 of 3
5. (op_1 obj_04 obj_01 obj_07)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_07)
   goals met: 2 of 3
6. (op_3 obj_04 obj_09 obj_07 obj_03)
   deleted: (pred_2 obj_04 obj_09 obj_03)
   added: (pred_3 obj_09 obj_07) (pred_1 obj_04 obj_03)
   goals met: 3 of 3
